# Напишите функцию, которая
# принимает два числа и
# печатает их произведение


# Там, где должны быть заданы переменные,
# которые являются аргументами, нельзя
# писать данные (литералы). Аргумент -
# это как бы контейнер, который принимает
# данные извне (при вызове функции)
def print_multiplication(5, 8):
    print(5 * 8)


# Здесь у функции недостаточно заданных
# аргументов. Ноль из двух.
print_multiplication()