# Напишите функцию, которая
# принимает два числа и
# печатает их произведение


def print_multiplication(number_one, number_two):
    print(number_one * number_two)


print_multiplication(2, 3)
print_multiplication(5.5, 4)
print_multiplication(17.39, 0.023)
print_multiplication("****Хакер****", 3)  # Использование не по смыслу