# Компьютер запрашивает у пользователя число N
# и создает таблицу (списки вложенные в список)
# размером N строк на N столбцов, заполненную
# следующим образом:
#     при N <= 0
#         пустой список
# 
#     при N = 1
#         [
#           [1]
#         ]
# 
#     при N = 2
#         [
#           [1, 0],
#           [0, 1]
#         ]
# 
#     при N = 3
#         [
#           [1, 0, 0],
#           [0, 1, 0],
#           [0, 0, 1],
#         ]
# 
#     при N = 4
#         [
#           [1, 0, 0, 0],
#           [0, 1, 0, 0],
#           [0, 0, 1, 0],
#           [0, 0, 0, 1],
#         ]
# 
#    и так далее
# 
#    За list comprehension  +1 коин


from pprint import pprint


n = input("Введите размер таблицы чисел (матрицы), целое число: ")
n = int(n)

table = []

if n > 0:
    for i in range(n):
        table.append([])
        for k in range(n):
            if i == k:
                table[i].append(1)
            else:
                table[i].append(0)

pprint(table, indent=4)
