# Создать список квадратов целых чисел от -3 до 7

numbers = [x * x for x in range(-3, 7 + 1)]
print(numbers)
